・正規表現で文字列の中から数字だけを取り出す
a = "gj9ut986u1@"
a.delete("^0-9")
↓
99861
-----------------------------------------------
・文字列になっている数字を数値に変換する
a = [”9”, ”9”, ”8”, ”6”, ”1”]
a.map(&:to_i)
↓
[9, 9, 8, 6, 1]
-----------------------------------------------
・配列に入っている数値の合計を求める
a = [9, 9, 8, 6, 1]
a.inject(:+)
↓
33
-----------------------------------------------
・消費税を計算する１
input = gets.chomp.split(' ')
D = input[0].to_f
小数点をつけて上げる
P = input[1].to_f
小数点をつけて上げる
puts (((100 + P) * D) / 100).floor
最初に整数で金額を出してから100で割ると
誤差が出にくくなる
-----------------------
・消費税を計算する２
require 'bigdecimal'
少数を含む金額の計算はBigDecimalを使う
a = gets.chomp.split(" ")
b = 1.0 + a[1].to_i / 100.0
c = b.round(2)
小数点第二位を四捨五入する
d = c.to_s
p (BigDecimal(a[0]) * BigDecimal(d)).floor
------------------------
・消費税を計算する３
a = gets.chomp.split(" ")
b = 1.0 + a[1].to_i / 100.0
c = b.to_s
p (Rational(a[0]) * Rational(c)).floor
------------------------------------------------
